//*****************************************************************************
//
// Имя файла    : 'gpio.h'
// Заголовок    : Драйвер GPIO
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 24.04.2013
//
//*****************************************************************************

#ifndef _GPIO_H
#define _GPIO_H

enum EGPIODir
{
	DIR_IN 	= 0,
	DIR_OUT = 1
};
// =============================================================================
//                           Прототиаы функций
// =============================================================================

	// Инициализация
	void GPIOInit (int gpio);
	// Установка линии в "1"
	void GPIOSet  (int gpio);
	// Установка линии в "0"
	void GPIOClr  (int gpio);
	// Изменение направления линии
	void GPIODir (int gpio, EGPIODir dir);
	// Проверка уровня линии
	int GPIOGet (int gpio);

#endif // _GPIO_H
