//*****************************************************************************
//
// Имя файла    : 'pwm.h'
// Заголовок    : Драйвер для работы с ШИМ
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 23.04.2013
//
//*****************************************************************************

#ifndef _PWM_H
#define _PWM_H

#include <pthread.h>

// =============================================================================
//                           Прототипы функций
// =============================================================================

void * ThreadPWM(void *arg);

// =============================================================================
//                                Классы
// =============================================================================

class CPWMCtrl
{
	friend  void * ThreadPWM(void *arg);
	
	protected: 
		pthread_t m_Thread;
		
	private:
		int m_Prc;
		int m_Chan;
		
	public:
		// Конструктор
		CPWMCtrl();
		int Create   (int chan);
		void Setdt(int prc);	
};

#endif // _PWM_H