//*****************************************************************************
//
// Имя файла    : 'serial.h'
// Заголовок    : Драйвер для работы с COM-портом
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 10.04.2013
//
//*****************************************************************************

#ifndef _SERIAL_H
#define _SERIAL_H

// =============================================================================
//                           Прототиаы функций
// =============================================================================

	// Настройка порта
	int  SetInterfaceAttribs (int fd, int speed, int parity);
	// Установка блокировки
	void SetBlocking		 (int fd, int should_block);

#endif // _SERIAL_H
