//*****************************************************************************
//
// Имя файла    : 'spi.h'
// Заголовок    : Драйвер SPI
// Автор        : Барышников Р. А.
// Контакты     : plexus_bra@rambler.ru
// Дата         : 26.06.2013
//
//*****************************************************************************

#ifndef _SPI_H
#define _SPI_H

// =============================================================================
//                           Прототипы функций
// =============================================================================

void * ThreadPWM(void *arg);

// =============================================================================
//                                Классы
// =============================================================================

class CPWMCtrl
{
	friend  void * ThreadPWM(void *arg);
	
	protected: 
		pthread_t m_Thread;
		
	private:
		int m_Prc;
		int m_Chan;
		
	public:
		// Конструктор
		CPWMCtrl();
		int Create   (int chan);
		void Setdt(int prc);	
};

#endif // _SPI_H